package com.saima.meituan5;
/*
* 套娃最近很流行，小美想知道前缀和是否也可以进行套娃操作。
小美现在想知道能否快速求解

 input:
第一行两个数N，K。
第二行N个数，第 i 个数为a[i]。

1<=N<=5000 ；1<=K<998244353；0<=a[i]<998244353
*
* output:
* 一个数表示sum[K][N]。
*
* 提示：
* 样例解释，需要三次求和：
*
4 3
1 0 0 0
*
10
*
*
第一次：sum[1][1] = sum[0][1] = 1, sum[1][2] = sum[0][1] + sum[0][2] = 1, sum[1][3] = sum[0][1] + sum[0][2] + sum[0][3] = 1, sum[1][4] = sum[0][1] + sum[0][2] + sum[0][3] + sum[0][4] = 1. sum[1][] = { 1, 1, 1, 1 };
第二次：sum[2][] = { 1, 2, 3, 4 }.
第三次：sum[3][] = { 1, 3, 6, 10 }.
故sum[K][N] = sum[3][4] = 10
* */
public class Main {
}
